>>SOURCE FORMAT FREE

IDENTIFICATION DIVISION.
PROGRAM-ID. Ficheiros_contatos.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
  SELECT OPTIONAL CONTATOS
    ASSIGN TO "CONTATOS.dat"
      ORGANIZATION IS LINE SEQUENTIAL.


    SELECT OPTIONAL CONTATOS-ORDENADOS
      ASSIGN TO "CONTATOS-ORDENADOS.dat"
      ORGANIZATION IS LINE SEQUENTIAL.



    SELECT OPTIONAL FICHEIRO-TEMPORARIO ASSIGN TO "CONTATOS.TMP".


DATA DIVISION.
FILE SECTION.
FD CONTATOS.
01 REGISTO.
  05 NOME PIC A(10).
  05 CONTATO PIC A(10).
  88 FIM-FICHEIRO VALUE HIGH-VALUES.

FD CONTATOS-ORDENADOS.
01 REGISTO-ORDENADO.
  05 NOME-ORDENADO PIC A(10).
  05 CONTATO-ORDENADO PIC A(10).
  88 FIM-FICHEIRO-ORDENADO VALUE HIGH-VALUES.

SD FICHEIRO-TEMPORARIO.
  01 REGISTO-TEMPORARIO.
    05 NOME-TEMPORARIO PIC A(10).
    05 CONTATO-TEMPORARIO PIC A(10).
    88 FIM-FICHEIRO-TEMPORARIO VALUE HIGH-VALUES.


WORKING-STORAGE SECTION.
77 OPCAO-MENU PIC 9.
77 SAIDA PIC 9.
77 NOME-EM-MEMORIA PIC A(10).
77 CONTATO-EM-MEMORIA PIC A(10).
77 NOME-ENCONTRADO PIC A VALUE "N".


PROCEDURE DIVISION.
   DISPLAY "Bem vindo a agenda eletronica. "

   PERFORM UNTIL SAIDA = 1
      PERFORM APRESENTAR-MENU
      EVALUATE OPCAO-MENU
      WHEN 1 PERFORM INSERIR-CONTATO

      WHEN 2 PERFORM LISTAR-CONTATOS

      WHEN 3 PERFORM ORDENAR-LISTAR-ORDEM-ALFABETICA

      WHEN 4 PERFORM PESQUISAR-POR-NOME

      WHEN 0 MOVE 1 TO SAIDA

      WHEN OTHER DISPLAY "Opcao invalida, tente novamente."

   END-PERFORM

   STOP RUN.


APRESENTAR-MENU.
    DISPLAY "Introduza uma das seguintes opçoes: "
    DISPLAY "1 - Inserir contato"
    DISPLAY "2 - listar todos os contatos "
    DISPLAY "3 - listar por nome"
    DISPLAY "4 - Pesquisar por nome"
    DISPLAY "0 - SAIR "
    ACCEPT OPCAO-MENU.

INSERIR-CONTATO.
    OPEN EXTEND CONTATOS.
    DISPLAY "Introduza o nome do seu contato"
    ACCEPT NOME
    DISPLAY "Introduza contato telefonico"
    ACCEPT CONTATO.

    WRITE REGISTO
    END-WRITE

    CLOSE CONTATOS.


LISTAR-CONTATOS.
    OPEN INPUT CONTATOS.
    *> Aqui estou a verificar se o arquivo está vazio ou se há registos para ler
    READ CONTATOS
      AT END SET FIM-FICHEIRO TO TRUE
    END-READ

    DISPLAY " Contatos na agenda:"

    PERFORM UNTIL FIM-FICHEIRO
      DISPLAY NOME " - " CONTATO
      DISPLAY " "
      READ CONTATOS
  *> Esta linha garante que a condição de fim do arquivo seja verificada a cada iteração do loop
        AT END SET FIM-FICHEIRO TO TRUE
      END-READ
    END-PERFORM

    CLOSE CONTATOS.


ORDENAR-LISTAR-ORDEM-ALFABETICA.

    SORT FICHEIRO-TEMPORARIO ON ASCENDING NOME-ORDENADO
    USING CONTATOS GIVING CONTATOS-ORDENADOS.

    PERFORM LISTAR-CONTATOS-ORDENADOS.


LISTAR-CONTATOS-ORDENADOS.
    OPEN INPUT CONTATOS-ORDENADOS.
    *> Aqui estou a verificar se o arquivo está vazio ou se há registos para ler
    READ CONTATOS-ORDENADOS
      AT END SET FIM-FICHEIRO-ORDENADO TO TRUE
    END-READ

    DISPLAY " Contatos na agenda:"

    PERFORM UNTIL FIM-FICHEIRO-ORDENADO
        MOVE NOME-ORDENADO TO NOME-EM-MEMORIA
        MOVE CONTATO-ORDENADO TO CONTATO-EM-MEMORIA
        DISPLAY NOME-EM-MEMORIA " - " CONTATO-EM-MEMORIA
        DISPLAY " "
        READ CONTATOS-ORDENADOS
  *> Esta linha garante que a condição de fim do arquivo seja verificada a cada iteração do loop
        AT END SET FIM-FICHEIRO-ORDENADO TO TRUE
      END-READ
    END-PERFORM

    CLOSE CONTATOS-ORDENADOS.


PESQUISAR-POR-NOME.

  OPEN INPUT CONTATOS
  DISPLAY "Introduza o nome que pretende procurar: " NO ADVANCING
  ACCEPT NOME-EM-MEMORIA

  MOVE "N" TO NOME-ENCONTRADO


  PERFORM UNTIL FIM-FICHEIRO OR NOME-ENCONTRADO = "S"
    READ CONTATOS
      AT END SET FIM-FICHEIRO TO TRUE
    END-READ

   IF NOME = NOME-EM-MEMORIA THEN
      MOVE "S" TO NOME-ENCONTRADO
      DISPLAY "Contato encontrado - " NOME " - " CONTATO

   END-IF


    END-PERFORM

    IF NOME-ENCONTRADO = "N" THEN
      DISPLAY "Contato nao localizado"
   END-IF


    CLOSE CONTATOS


.
