IDENTIFICATION DIVISION.
PROGRAM-ID. insert_vendor.
 ENVIRONMENT DIVISION.
 INPUT-OUTPUT SECTION.
   FILE-CONTROL.
   COPY "slvendor.cbl".

DATA DIVISION.
FILE SECTION.
   COPY "fdvendor.cbl".

WORKING-STORAGE SECTION.

  *> LINKAGE SECTION.

    77 INSERT-VENDOR-NUMBER      PIC 9(5).
    77 INSERT-VENDOR-NAME        PIC X(30).



PROCEDURE DIVISION. *> USING INSERT-VENDOR-NUMBER, INSERT-VENDOR-NAME.

    PERFORM RECEBER-DADOS.
    PERFORM ESCREVER-FICHEIRO.
    PERFORM MOSTRAR-INSERCAO.

STOP RUN.

RECEBER-DADOS.
    DISPLAY "Introduza o ID do fornecedor"
    ACCEPT INSERT-VENDOR-NUMBER
    DISPLAY "Introduza o nome do fornecedor"
    ACCEPT INSERT-VENDOR-NAME.


ESCREVER-FICHEIRO.
    OPEN I-O VENDOR-FILE
        MOVE INSERT-VENDOR-NUMBER TO VENDOR-NUMBER
        MOVE INSERT-VENDOR-NAME TO VENDOR-NAME
        WRITE VENDOR-RECORD
    CLOSE VENDOR-FILE.

MOSTRAR-INSERCAO.
    DISPLAY INSERT-VENDOR-NAME " introduzido com o ID " INSERT-VENDOR-NUMBER.
