
IDENTIFICATION DIVISION.
PROGRAM-ID. delete_aluno.
ENVIRONMENT DIVISION.
    INPUT-OUTPUT SECTION.
        FILE-CONTROL.
            COPY "slaluno.cbl".

DATA DIVISION.
    FILE SECTION.
        COPY "fdaluno.cbl".
WORKING-STORAGE SECTION.

  77 DELETE-ID-ALUNO           PIC 9(5).
  77 FILLER             PIC X VALUE SPACE.
  77 DELETE-NOME-ALUNO         PIC X(30).
  77 FILLER PIC X VALUE SPACE .
  77 DELETE-NOTA1             PIC 99V99.
  77 FILLER PIC X VALUE SPACES.
  77 DELETE-NOTA2              PIC 99V99.
  77 FILLER PIC X VALUE SPACES.
  77 DELETE-NOTA3             PIC 99V99.
  77 FILLER PIC X VALUE SPACES.
  77 DELETE-MEDIAALUNO        PIC 99V99.
  77 DELETE-FIM-FICHEIRO     PIC X VALUES 'N'.

PROCEDURE DIVISION.


  PERFORM RECEBER-VENDOR
  PERFORM APAGAR-VENDOR
    STOP RUN.



RECEBER-VENDOR.
       DISPLAY " ".
       DISPLAY "Introduza o ID do aluno que deseja apagar: " WITH NO ADVANCING.
       ACCEPT DELETE-ID-ALUNO.



APAGAR-VENDOR.
        OPEN I-O FICHEIRO-ALUNOS.
        PERFORM UNTIL DELETE-FIM-FICHEIRO = 'Y'
           READ FICHEIRO-ALUNOS
            AT END MOVE 'Y' TO DELETE-FIM-FICHEIRO
            NOT AT END
                IF ID-ALUNO = DELETE-ID-ALUNO
                    MOVE  NOME-ALUNO TO DELETE-NOME-ALUNO
                    DELETE FICHEIRO-ALUNOS
                        INVALID KEY DISPLAY "Id nao existe."
                    END-DELETE

                    MOVE 'Y' TO DELETE-FIM-FICHEIRO
           END-READ
        END-PERFORM
    CLOSE FICHEIRO-ALUNOS
    DISPLAY "O fornecedor " DELETE-NOME-ALUNO " foi apagado com sucesso."
.
