$set sourceformat(free)

FD FICHEIRO-ALUNOS.
01 REGISTO-ALUNO.
  05 ID-ALUNO           PIC 9(5).
  05 FILLER             PIC X VALUE SPACE.
  05 NOME-ALUNO         PIC X(30).
  05 FILLER PIC X VALUE SPACE .
  05  NOTA1             PIC 99V99.
  05 FILLER PIC X VALUE SPACES.
  05 NOTA2              PIC 99V99.
  05 FILLER PIC X VALUE SPACES.
  05  NOTA3             PIC 99V99.
  05 FILLER PIC X VALUE SPACES.
