IDENTIFICATION DIVISION.
PROGRAM-ID. insert_alunos.
 ENVIRONMENT DIVISION.
 INPUT-OUTPUT SECTION.
   FILE-CONTROL.
   COPY "slaluno.cbl".

DATA DIVISION.
FILE SECTION.
   COPY "fdaluno.cbl".

WORKING-STORAGE SECTION.

  *> LINKAGE SECTION.

    77 INSERT-ID-ALUNO           PIC 9(5).
    77 FILLER PIC X VALUE SPACES.
    77 INSERT-NOME-ALUNO         PIC X(30).
    77 FILLER PIC X VALUE SPACES.
    77 INSERIR-NOTA1             PIC 99V99.
    77 FILLER PIC X VALUE SPACES.
    77 INSERIR-NOTA2              PIC 99V99.
    77 FILLER PIC X VALUE SPACES.
    77  INSERIR-NOTA3             PIC 99V99.
    77 FILLER PIC X VALUE SPACES.
    77  INSERIR-MEDIA-ALUNO        PIC 99V99.

  77 INSERIR-FIM-FICHEIRO       PIC X VALUES 'N'.



PROCEDURE DIVISION. *> USING INSERT-VENDOR-NUMBER, INSERT-VENDOR-NAME.

    PERFORM RECEBER-DADOS.
    PERFORM ESCREVER-FICHEIRO.
    PERFORM MOSTRAR-INSERCAO.

STOP RUN.

RECEBER-DADOS.
    DISPLAY "Introduza o ID do aluno"
    ACCEPT INSERT-ID-ALUNO
    DISPLAY "Introduza o nome do aluno"
    ACCEPT INSERT-NOME-ALUNO
    DISPLAY "Introduza a primeira nota"
    ACCEPT INSERIR-NOTA1
    DISPLAY "Introduza a segunda nota"
    ACCEPT INSERIR-NOTA2
    DISPLAY "Introduza a terceira nota"
    ACCEPT INSERIR-NOTA3
.

ESCREVER-FICHEIRO.
    OPEN I-O FICHEIRO-ALUNOS
         MOVE INSERT-ID-ALUNO TO ID-ALUNO
         MOVE INSERT-NOME-ALUNO TO NOME-ALUNO
         MOVE INSERIR-NOTA1 TO NOTA1
         MOVE INSERIR-NOTA2 TO NOTA2
         MOVE INSERIR-NOTA3 TO NOTA3
         WRITE REGISTO-ALUNO
    CLOSE FICHEIRO-ALUNOS.

MOSTRAR-INSERCAO.
    DISPLAY INSERT-NOME-ALUNO " introduzido com o ID: " INSERT-ID-ALUNO
    DISPLAY "Nota1: " INSERIR-NOTA1
    DISPLAY "Nota2: " INSERIR-NOTA2
    DISPLAY "Nota3: " INSERIR-NOTA3 "."


    .
